{
    "sections": [
        {
            "id": "naf-history",
            "logo": "images/naf-logo.png",
            "title": "NAF History",
            "year-ranges": [
                {
                    "1962-1972": [
                        {
                            "year": "1962",
                            "highlights": [
                                {
                                    "description": "The Nigerian Government agreed in principle the establishment of the Nigerian Air Force (NAF).",
                                    "images": []
                                },
                                {
                                    "description": "June 1962 - First Batch of 10 cadets were enlisted to undergo training with the Imperial Ethiopian Air Force with only 4 successfully completing their training in 1964 and were enlisted as pioneer pilots of the Nigerian Air Force. These 4 pilots are: John Yisa-Doko (Northern Region), Daniel Suleiman (Northern region), Kola Falokpe (Western Region), and Onyerimba Faka (Eastern Region).",
                                    "images": ["images/naf-history/1962-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1963",
                            "highlights": [
                                {
                                    "description": "February 1963 – A Second Batch of 16 cadets were enlisted to train with the Royal Canadian Air Force.",
                                    "images": ["images/naf-history/1963-1-1.jpg", "images/naf-history/1963-1-2.jpg"]
                                },
                                {
                                    "description": "A Third Batch of 6 cadets were sent to train with the Indian Air Force.",
                                    "images": ["images/naf-history/1963-2-1.jpg"]
                                },
                                {
                                    "description": "West Germany received the contract for the establishment of the Nigerian Air Force with technical assistance from the German Air Force Technical Assistance Group (GAFTAG). The head of GAFTAG was Colonel Gerhard Kahtz. He was later appointed as the first Commander of the Nigerian Air Force upon its formal establishment.",
                                    "images": ["images/naf-history/1963-3-1.jpg"]
                                },
                                {
                                    "description": "The Fourth Batch of cadets were sent to train with the German Air Force.",
                                    "images": ["images/naf-history/1963-4-1.jpg"]
                                },
                                {
                                    "description": "The Nigerian Air Force Tactical and Training Wing (NAFTTW) was built by the German Air Force Technical Assistance Group.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1964",
                            "highlights": [
                                {
                                    "description": "18 April 1964 – The Nigerian Air Force was formally established with the passage of the Air Force Act 1964 by the National Assembly.",
                                    "images": ["images/naf-history/1964-1-1.jpg"]
                                },
                                {
                                    "description": "Alhaji Tanko Galadima was the First Minister of the Nigerian Air Force (1964-1966).",
                                    "images": ["images/naf-history/1964-2-1.jpg"]
                                },
                                {
                                    "description": "Ministry of Defence was the Headquarters of the Nigerian Air Force with Alhaji Muhammadu Ribadu as Minister of Defence (1960-1965).",
                                    "images": []
                                },
                                {
                                    "description": "The Nigerian Air Force commenced operations as an air transport and training unit. The Germans supplied the first-generation air assets which included the Aerospatiale Allouette helicopter, 20 Dornier DO-27 transport aircraft, 14 Piaggio 149D trainer aircraft, and Nord Noratlas platforms for transport.",
                                    "images": ["images/naf-history/1964-3-1.jpg", "images/naf-history/1964-3-2.jpg", "images/naf-history/1964-3-3.jpg"]
                                },
                                {
                                    "description": "Construction of the first Nigerian Air Force base begun and was established in Kaduna.",
                                    "images": ["images/naf-history/1964-4-1.jpg", "images/naf-history/1964-4-2.jpg", "images/naf-history/1964-4-3.jpg", "images/naf-history/1964-4-4.jpg", "images/naf-history/1964-4-5.jpg", "images/naf-history/1964-4-6.jpg"]
                                },
                                {
                                    "description": "The First 4 Nigerian Army officers seconded to the Nigerian Air Force were: Lieutenant Colonel George T Kurobo, Colonel Shittu Akanji Alao, Lieutenant Colonel Emmanuel E Ikwue, and Major John Esio Obada.",
                                    "images": []
                                },
                                {
                                    "description": "Malachy Njoku was the First Sergeant of the Nigerian Air Force.",
                                    "images": []
                                },
                                {
                                    "description": "Squadron Leader John Chukwu was the First Qualified Flight Instructor (QFI) of the Nigerian Air Force.",
                                    "images": ["images/naf-history/1964-5-1.jpg"]
                                },
                                {
                                    "description": "Lance Corporal Adamu and Lance Corporal Doyle were amongst the First Corporals of the Nigerian Air Force.",
                                    "images": []
                                },
                                {
                                    "description": "Air Vice Marshal AD Bello was the First NAF officer to attend the prestigious Air War College in the United States. Light Liaison Transport Squadron (Present day 401Flying Training School) was established in Kaduna for converting NAF pilots trained overseas.",
                                    "images": []
                                },
                                {
                                    "description": "Light Liaison Transport Squadron (Present day 401Flying Training School) was established in Kaduna for converting NAF pilots trained overseas.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1965",
                            "highlights": [
                                {
                                    "description": "24 November 1965 - Colonel W Timming was appointed the Second Commander of the Nigerian Air Force.",
                                    "images": ["images/naf-history/1965-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1966",
                            "highlights": [
                                {
                                    "description": "Jan 1966 - German Air Force Technical Assistance Group (GAFTAG) departed Nigeria and handed over command.",
                                    "images": []
                                },
                                {
                                    "description": "19 Jan 1966 - George T Kurubo was appointed the Third Commander and was the first indigenous Commander of the Nigerian Air Force. He held this office till 12 August 1967 when he was appointed Ambassador to the Soviet Union.",
                                    "images": ["images/naf-history/1966-1-1.jpg", "images/naf-history/1966-1-2.jpg"]
                                },
                                {
                                    "description": "Jan 1966 –The First Nigerian Air Force hangar was commissioned at the Nigerian Air Force Base Kaduna.",
                                    "images": []
                                },
                                {
                                    "description": "23 May 1966 – The First Nigerian Air Force plane crash occurred at Ibadan Airport killing Lieutenant Jasper Onyeji and Lieutenant D.F Onyirimba in a Piaggio P-149D while doing aerobatics that went sour.",
                                    "images": ["images/naf-history/1966-3-1.jpg", "images/naf-history/1966-3-2.png"]
                                }
                            ]
                        },
                        {
                            "year": "1967",
                            "highlights": [
                                {
                                    "description": "6 July 1967 - The Nigerian Civil War begins.",
                                    "images": []
                                },
                                {
                                    "description": "5 August 1967 - The First Nigerian Air Force helicopter crash occurred killing Colonel Joseph Akahan who was the Chief of Army Staff and two young pilots: 2nd Lieutenant G Ozie and 2nd Lieutenant Olawale Lawal. The aircraft crashed in Wannune village located between Gboko and Makurdi.",
                                    "images": ["images/naf-history/1967-1-1.jpg", "images/naf-history/1967-1-2.jpg"]
                                },
                                {
                                    "description": "5 August 1967 - Colonel Shittu Akanji Alao was appointed the Fourth Commander of the Nigerian Air Force. He held this office until his death on 15 December 1969 while on a solo flight in an L-29 aircraft in the Southern-western part of the country when he ran into bad weather and subsequently ran out of fuel. He tried to make an emergency landing, but instead, ran into a tree and died in the process. He died at Uzebba, about 50 miles Northwest of Benin. He became the First Commander and Chief of the Air Staff to die on active duty.",
                                    "images": ["images/naf-history/1967-2-1.jpg", "images/naf-history/1967-2-2.jpg"]
                                },
                                {
                                    "description": "13 August 1967 - Biafran Aircraft bombs Lagos causing damages to the Nigerian Air Force fleet and installations.",
                                    "images": ["images/naf-history/1967-3-1.jpg"]
                                },
                                {
                                    "description": "Acquisition of the First Batch of combat aircraft from the Soviet Union. The Nigerian Air Force received some unknown numbers of Mikoyan-Hurevich MiG-17Fs which were delivered to Kano from Egypt. Later, 6 Ilyushin Il-28 medium Bombers were delivered from Egypt and stationed at Calabar and Port Harcourt. The Light Liaison Transport Squadron was renamed Primary Flying Training Wing (PFTW) to undertake ab-initial flying training and earlier task of transport conversion.",
                                    "images": ["images/naf-history/1967-4-1.jpg", "images/naf-history/1967-4-2.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1969",
                            "highlights": [
                                {
                                    "description": "5 June 1969 - Nigerian Air Force MiG-17 allegedly operated by a British mercenary pilot guns down a Swedish Red Cross DC 7 plane while delivering relief supplies to Biafra. As a result, the Red Cross ceases air deliveries of aid.",
                                    "images": ["images/naf-history/1969-1-1.jpg"]
                                },
                                {
                                    "description": "17 December 1969 - Brigadier Emmanuel E Ikwue was appointed the Fifth Commander of the Nigerian Air Force and later became the First Nigerian Air Force Commander to hold the office now designated as the Office of the Chief of the Air Staff of the Nigerian Air Force. He held this Office till the 28 July 1975.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1970",
                            "highlights": [
                                {
                                    "description": "15 January 1970 - The Civil War ended. Below is an inventory of the total equipment damage inflicted on the Nigerian Armed Forces:",
                                    "images": []
                                },
                                {
                                    "description": "13 June 1970 - The First Group of Nigerian trained Nigerian Air Force cadet pilots graduated in Kaduna.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1971",
                            "highlights": [
                                {
                                    "description": "Estimated figures showed the Nigerian Air Force owned about 7,000 personnel and 32 combat aircraft.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "1973-1983": [
                        {
                            "year": "1975",
                            "highlights": [
                                {
                                    "description": "29 July 1975 - Air Vice Marshall John Nmadu Yisa-Doko was appointed the Sixth Chief of the Air Staff. He was the First Airman to be appointed Chief of the Air Staff. He is also the First to attain the rank of Air Vice Marshall in the Nigerian Air Force.",
                                    "images": ["images/naf-history/1975-1-1.jpg", "images/naf-history/1975-1-2.jpg"]
                                },
                                {
                                    "description": "25 Mikoyan-Gurevich MiG-21MFs and 6 MiG-21UM were purchased and delivered by the Murtala-Obasanjo administration.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1976",
                            "highlights": [
                                {
                                    "description": "The Nigerian Air Force was presented with its Colours by General Olusegun Obasanjo the Head of the Federal Military Government and Commander-in-Chief of the Armed Forces at the occasion of the First Air Force Day.",
                                    "images": ["images/naf-history/1976-1-1.jpg"]
                                },
                                {
                                    "description": "1 April 1976 - The Federal Military Government authorized the adoption of a complete Air Force rank structure to give the Nigerian Air Force full-service independence.",
                                    "images": ["images/naf-history/1976-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1977",
                            "highlights": [
                                {
                                    "description": "Nigerian Air Force Training supply school (TSS) was established in Kaduna as an indigenous technical supply school.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1978",
                            "highlights": [
                                {
                                    "description": "In a bid to restructure the Nigerian Air Force, the Tactical Air Command and the Training Command were established.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1979",
                            "highlights": [
                                {
                                    "description": "The Technical Supply School was renamed Technical Training Wing and redesignated NAF Technical Training Group (NAFTTG) Kaduna. It was responsible for providing basic training in aircraft maintenance, armament, communication and supply management.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1980",
                            "highlights": [
                                {
                                    "description": "15 April 1980 - Air Vice Marshal Abdullahi Dominic Bello was appointed the Seventh Chief of the Air Staff. He held this Office till 31 December 1983.",
                                    "images": ["images/naf-history/1980-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1982",
                            "highlights": [
                                {
                                    "description": "The Nigerian Air Force Logistics Command was established in Lagos.",
                                    "images": ["images/naf-history/1982-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1983",
                            "highlights": [
                                {
                                    "description": "New wings for the Nigerian Air Force aircrew were introduced to replace the near foreign ones in use.",
                                    "images": ["images/naf-history/1983-1-1.jpg"]
                                }
                            ]
                        }
                    ]
                },
                {
                    "1984-1994": [
                        {
                            "year": "1984",
                            "highlights": [
                                {
                                    "description": "01 January 1984 – Air Marshal Ibrahim Mahmud Alfa was appointed the Eight Chief of the Air Staff. He held this office until 01 January 1990.",
                                    "images": ["images/naf-history/1984-1-1.jpg"]
                                },
                                {
                                    "description": "18 SEPECAT Jaguar fighters were delivered and operated from Makurdi.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1986",
                            "highlights": [
                                {
                                    "description": "December 1986 – The Tactical Air Command announced the establishment of a unit of Aermacchi MB-339AN trainers at Calabar.",
                                    "images": []
                                },
                                {
                                    "description": "24 Aero L-39 Albatros armed jet trainers were purchased.",
                                    "images": []
                                },
                                {
                                    "description": "The L-39 were purchased after having retired its fleet of Aero L-29 Delfin.",
                                    "images": []
                                },
                                {
                                    "description": "PFTW was upgraded to a group status and renamed 301 Flying Training School (301 FTS).",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1987",
                            "highlights": [
                                {
                                    "description": "1 October 1987 - Ibrahim Mahmud Alfa was the First Nigerian Air Force officer to be promoted to the rank of Air Marshal.",
                                    "images": ["images/naf-history/1987-1-1.jpg"]
                                },
                                {
                                    "description": "March 1987 - The Nigerian Air Force completed the installation of the Inter-command Communication System.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1988",
                            "highlights": [
                                {
                                    "description": "June 1988 - The Nigerian Air Force was organized into 4 specialized Commands which are: Tactical Command (Makurdi), Training Command (Kaduna), Logistics Command (Lagos), and Airlift Command (Ibadan).",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "1989",
                            "highlights": [
                                {
                                    "description": "The Nigerian Air Force unveiled its first Locally built trainer aircraft dubbed the \"Air Beetle\".",
                                    "images": ["images/naf-history/1989-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1990",
                            "highlights": [
                                {
                                    "description": "Air Marshal Nuraini Oladimeji Yussuff was appointed the Ninth Chief of the Air Staff. He held this Office until his retirement on 30 January 1992.",
                                    "images": ["images/naf-history/1990-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1992",
                            "highlights": [
                                {
                                    "description": "31 January 1992 – Air Marshal Akin Dada was appointed the Tenth Chief of the Air Staff. He held this Office until his retirement on 16 September 1993.",
                                    "images": ["images/naf-history/1992-1-1.jpg"]
                                },
                                {
                                    "description": "26 Sept 1992 – A fatal air crash involving a Nigerian Air Force Lockheed C-130H Hercules 911, 3 minutes after take-off from Lagos when 3 engines failed killing all 158 passengers and crew members. It crashed at the Ejigbo Canal.",
                                    "images": ["images/naf-history/1992-2-1.jpg", "images/naf-history/1992-2-2.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1993",
                            "highlights": [
                                {
                                    "description": "17 September 1993 – Air Vice Marshal Femi John Femi was appointed the Eleventh Chief of the Air Staff. He held this Office until his retirement on 29 March 1996.",
                                    "images": ["images/naf-history/1993-1-1.jpg"]
                                }
                            ]
                        }
                    ]
                },
                {
                    "1995-2005": [
                        {
                            "year": "1996",
                            "highlights": [
                                {
                                    "description": "30 March 1996 – Air Marshal Nsikak-Abasi Essien Eduok was appointed as the Twelfth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 29 May 1999.",
                                    "images": ["images/naf-history/1996-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1998",
                            "highlights": [
                                {
                                    "description": "9 June 1998 - Air Marshal Al-Amin Daggash was the First Nigerian Air Force Chief of Defence Staff.",
                                    "images": ["images/naf-history/1998-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "1999",
                            "highlights": [
                                {
                                    "description": "10 March 1999 - Habibah Ruth Garba was the First female Air Commodore in the Nigerian Air Force.",
                                    "images": ["images/naf-history/1999-1-1.jpg"]
                                },
                                {
                                    "description": "29 May 1999 – Air Marshal Isaac Mohammed Alfa was appointed as the Thirteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 23 April 2001.",
                                    "images": ["images/naf-history/1999-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2000",
                            "highlights": [
                                {
                                    "description": "Technical Training Group was designated as 320 Technical Training Group (320 TTG), Kaduna.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "2001",
                            "highlights": [
                                {
                                    "description": "24 April 2001 – Air Marshal Jonah Domfa Wuyep was appointed as the Fourteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 31 May 2006.",
                                    "images": ["images/naf-history/2001-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2005",
                            "highlights": [
                                {
                                    "description": "The Nigerian Government approved $251 million for the purchase of 15 Chengdu F-7 fighter jets from China. The package included $220 million for the 15 aircraft and $32 million for armaments.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "2006-2016": [
                        {
                            "year": "2006",
                            "highlights": [
                                {
                                    "description": "01 June 2006 - Air Marshal Paul Dike was appointed as the Fifteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his appointment as Chief of the Defence Staff on 19 August 2008.",
                                    "images": ["images/naf-history/2006-1-1.jpg"]
                                },
                                {
                                    "description": "17 Sept 2006 – Air crash involving several Army officers in Obudu, Cross-River State.",
                                    "images": ["images/naf-history/2006-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2008",
                            "highlights": [
                                {
                                    "description": "12 March 2008 – The 320 Technical Training Group on expansion and full accreditation by NBTE and NUC as well as its affiliation to Cranfield University was renamed Air Force Institute of Technology (AFIT).",
                                    "images": ["images/naf-history/2008-1-1.jpg"]
                                },
                                {
                                    "description": "12 March 2008 - The Nigerian Air Force Institute of Technology (AFIT) was established.",
                                    "images": ["images/naf-history/2008-1-2.jpg"]
                                },
                                {
                                    "description": "20 August 2008 - The First Nigerian Air Force officer to attain the rank of Air Chief Marshal was Air Marshal Paul Dike upon his appointment as the Chief of Defence Staff.",
                                    "images": ["images/naf-history/2008-2-1.jpg"]
                                },
                                {
                                    "description": "20 August 2008 - Air Marshal Oluseyi Petinrin was appointed as the Sixteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his appointment as Chief of the Defence Staff on 18 September 2010.",
                                    "images": ["images/naf-history/2008-3-1.jpg"]
                                },
                                {
                                    "description": "The Nigerian Air Force trained the pioneer Chengdu F-7 fighter pilots in China while delivery of the aircraft began in 2009.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "2009",
                            "highlights": [
                                {
                                    "description": "September 2009 - The Nigerian Air Force began refurbishing some of its C-130 aircraft beginning with the NAF 917.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "2010",
                            "highlights": [
                                {
                                    "description": "The Nigerian Air Force designed and built its First indigenous Unmanned Aerial Vehicle (UAV) dubbed \"GULMA\" and was unveiled by former President Goodluck Jonathan in Kaduna.",
                                    "images": ["images/naf-history/2010-1-1.jpg", "images/naf-history/2010-1-2.jpg"]
                                },
                                {
                                    "description": "19 September 2010 - Air Marshal MD Umar was appointed as the Seventeenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 03 October 2012.",
                                    "images": ["images/naf-history/2010-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2011",
                            "highlights": [
                                {
                                    "description": "29 March 2011 - The Nigerian Air Force established the Mobility Command with its Headquarters in Yenogoa.",
                                    "images": ["images/naf-history/2011-1-1.jpg", "images/naf-history/2011-1-2.jpg"]
                                },
                                {
                                    "description": "9 December 2011 - The Nigerian Air Force commissioned its First female pilot, Flt Lt Blessing Liman.",
                                    "images": ["images/naf-history/2011-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2012",
                            "highlights": [
                                {
                                    "description": "04 October 2012 - Air Marshal Alex Sabundu Badeh was appointed the Eighteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his appointment as the Fifteenth Chief of Defence Staff on 15 January 2014.",
                                    "images": ["images/naf-history/2012-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2014",
                            "highlights": [
                                {
                                    "description": "16 January 2014 - Air Marshal Adesola Nunayon Amosu was appointed the Nineteenth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 12 July 2015.",
                                    "images": ["images/naf-history/2014-1-1.jpg"]
                                },
                                {
                                    "description": "18 April 2014 - The Nigerian Air Force marked its 50 years Golden Jubilee Celebration.",
                                    "images": []
                                },
                                {
                                    "description": "25 September 2014 - The CH-3A UCAV was inducted into the Nigerian Air Force fleet.",
                                    "images": ["images/naf-history/2014-3-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2015",
                            "highlights": [
                                {
                                    "description": "13 July 2015 - Air Marshal Sadique Baba Abubakar was appointed the Twentieth Chief of the Air Staff of the Nigerian Air Force. He held this Office until his retirement on 25 January 2021.",
                                    "images": ["images/naf-history/2015-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2016",
                            "highlights": [
                                {
                                    "description": "19 November 2016 - The Nigerian Air Force established the Special Operations Command (SOC) in Bauchi.",
                                    "images": []
                                },
                                {
                                    "description": "301 FTS was redesignated 401 Flying Training School (401 FTS).",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "2017-2027": [
                        {
                            "year": "2017",
                            "highlights": [
                                {
                                    "description": "8 June 2017 - The Nigerian Air Force established the Nigerian Air Force Tailoring Workshop in Kaduna.",
                                    "images": ["images/naf-history/2017-1-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2018",
                            "highlights": [
                                {
                                    "description": "15 February 2018 – The Nigerian Air Force inducted its first locally-built operational UAV drone dubbed the \"TSAIGUMI\". The induction was done by the President and Commander-in-Chief of the Armed Forces, Muhammadu Buhari. The drone was made by the Nigerian Air Force Institute of Technology.",
                                    "images": ["images/naf-history/2018-1-1.jpg", "images/naf-history/2018-1-2.jpg", "images/naf-history/2018-1-3.jpg"]
                                },
                                {
                                    "description": "16 April 2018 - Winging of the First Set of Liberian pilots that were trained for the Liberian Armed Forces.",
                                    "images": ["images/naf-history/2018-2-1.jpg"]
                                },
                                {
                                    "description": "2 May 2018 - The Nigerian Air Force established the Ground Training Command (GTC) in Enugu having been unbundled from the erstwhile Training Command on 4 July 2017.",
                                    "images": []
                                },
                                {
                                    "description": "28 September 2018 - A fatal air collision involving two F-7 jets as they practiced flight maneuvers for the 58th Independence Day Celebrations in Abuja. The 3 pilots ejected out of the crippled jets with 2 sustaining minor G-force injuries while the third pilot died on his way to the hospital after sustaining head injuries due to problems from the parachute as it deployed.",
                                    "images": ["images/naf-history/2018-4-1.jpg", "images/naf-history/2018-4-2.png"]
                                },
                                {
                                    "description": "November 2018 - Sierra Nevada was officially awarded the contract for twelve A-29 Super Tucano aircraft for the Nigerian Air Force with an estimated completion date by 2024.",
                                    "images": []
                                }
                            ]
                        },
                        {
                            "year": "2019",
                            "highlights": [
                                {
                                    "description": "2 January 2019 - A Mi-35M attack helicopter crashed in Damasak, Borno State while providing close-air support for troops of the 145 Battalion combating Boko Haram insurgents, killing all onboard.",
                                    "images": []
                                },
                                {
                                    "description": "15 October 2019 - The Nigerian Air Force winged Lieutenant Kafayat Sanni as its First female combat fighter jet pilot.",
                                    "images": ["images/naf-history/2019-1-1.jpg", "images/naf-history/2019-1-2.jpg"]
                                },
                                {
                                    "description": "15 October 2019 – The Nigerian Air Force winged Lieutenant Tolulope Arotile as its first female combat helicopter pilot. She was amongst thirteen other pilots also winged that same day.",
                                    "images": ["images/naf-history/2019-2-1.jpg", "images/naf-history/2019-2-2.jpg", "images/naf-history/2019-2-3.png"]
                                },
                                {
                                    "description": "15 October 2019 - Master Warrant Officer Grace Garba became the First female Senior Non-Commissioned Officer (SNCO) to be promoted to the rank of Air Warrant Officer.",
                                    "images": ["images/naf-history/2019-3-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2020",
                            "highlights": [
                                {
                                    "description": "28 May 2020 - The Nigerian Air Force recorded its First all-female crew to conduct an operational Intelligence, Surveillance and Reconnaissance (ISR) mission using the NAF Beechcraft King Air ISR aircraft.",
                                    "images": ["images/naf-history/2020-1-1.jpg", "images/naf-history/2020-1-2.jpg"]
                                },
                                {
                                    "description": "Flying Officer Oluwabunmi Ijelu was the First female officer to become a Captain on a NAF aircraft.",
                                    "images": ["images/naf-history/2020-2-1.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2021",
                            "highlights": [
                                {
                                    "description": "26 January 2021 - Air Marshal Oladayo Isiaka Amao was appointed the Twenty-first Chief of the Air Staff, an Office he holds till date.",
                                    "images": ["images/naf-history/2021-1-1.jpg"]
                                },
                                {
                                    "description": "31 March 2021 - An Alpha jet with pilot, Flight Lieutenant Chappelle and another crew member crashed near Borno State after conducting air interdiction on Boko Haram. The jet was reported to have stopped pinging on radar at about 5:08pm and was presumed to have crashed. The wreckage was reported missing and found nineteen months later by the Nigerian Army troops.",
                                    "images": []
                                },
                                {
                                    "description": "20 May 2021 - Induction of three Pakistani JF-17 Thunder to the Nigerian Air Force. The Ceremony was done to mark the end of the 2021 Nigerian Air Force Day Celebration.",
                                    "images": []
                                },
                                {
                                    "description": "22 May 2021 - A Fatal plane crash occurred killing the Chief of Army Staff, Lt Gen Ibrahim Attahiru and 10 other Nigerian Army officers including the crew members. The crash occurred when the plane was trying to land in bad weather at the Kaduna International Airport. The crew members were Flt Lt TO Asaniyi, Flt Lt AA Olufade, Sgt Adesina and ACM Oyedepo.",
                                    "images": ["images/naf-history/2021-2-1.jpg", "images/naf-history/2021-2-2.jpg", "images/naf-history/2021-2-3.jpg"]
                                },
                                {
                                    "description": "18 July 2021 - Alpha Jet pilot Flight Lieutenant Abayomi Dairo was shot down by armed bandits in Zamfara State while returning from an air interdiction mission along the Kaduna-Zamfara boundaries. He successfully ejected from the plane, evaded capture and made his way to the base in the area having sustained minor injuries. He was received by the Chief of Defence Staff and the Chief of Air Staff.",
                                    "images": ["images/naf-history/2021-3-1.png", "images/naf-history/2021-3-2.jpg"]
                                },
                                {
                                    "description": "22 July 2021 - The First Batch of 6 A-29 Super Tucano aircraft arrived Kano, Nigeria. The aircraft were received by the Honourable Minister of Defence, Major General Bashir Magashi (Rtd), alongside the Chief of Army Staff, Lieutenant General Faruk Yahaya and the Chief of Air Staff, Air Marshal Oladayo Amao.",
                                    "images": []
                                },
                                {
                                    "description": "31 August 2021 - The newly acquired A-29 Super Tucano aircraft were inducted into the Nigerian Air Force (NAF) Order of Battle at the 011 Presidential Air Fleet Apron, Nnamdi Azikiwe International Airport, Abuja. The Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria, President Muhammadu Buhari, GCFR, presided over the Induction Ceremony as the Special Guest of Honour. The Super Tucanos received the following serials: NAF845, NAF846, NAF848, NAF850, NAF851 and NAF852.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id":"nafsfa-history",
            "logo":"images/nafsfa-logo.png",
            "title":"NAF School of Finance and Accounts",
            "year-ranges":[
                {
                    "2006-2016": [
                        {
                            "year": "2015",
                            "highlights": [
                                {
                                    "description": "Graduation ceremony of Accounts Upgrading (A2 – A1) Course 1/2015 with pioneer staff and students. Standing from the left: MWO Banny A (Instr), WO Fagbohun O (Instr), Sgt Fatai AA, Sgt Oruekhigbemen P, Sgt Onuh S, Sgt Imbazi ML, Sgt Zinchak DS, Sgt Ogbu OD, Sgt Jauro BB, Sgt Aworo DR, Sgt Peter I, WO Otegbeye A (Instr), Cpl Oyema CO, FS Olatunji O and WO Sanni MO (Instr). Sitting from the left: Fg Offr PS Onah, Sqn Ldr BS Utoruwei (CI), Gp Capt HA Adebowale (Comdt), Gp Capt RT Ojo and Flt Lt AO Asu.",
                                    "images": ["images/nafsfa-history/19.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Accounts Upgrading (A3 – A2) Course 2/2015. Standing from the left: Flt Lt AO Asu, WO Sanni MO, WO Fagbohun O, Cpl Oluwole OC, Cpl Ogunyemi O, Cpl Aburumakun, Cpl Ibeze MI, Lcpl Oloidi SK, Cpl Alozie CO, Cpl Akor FA, Cpl Isaka L, Cpl Lebari LT, Cpl Oyema, FS Olatunji O and WO Otegbeye A. Sitting from the left: Sqn Ldr BS Utoruwei (CI), Gp Capt RT Ojo, Rep of Oba Apa, Gp Capt GN Udoh, CO 243 Recce Bn, Gp Capt HA Adebowale (Comdt), Air Cdre JA Ochomma (Comd 081PAG), Air Cdre C Umolu, Rep DG Ascon, 2iC CO 243 Recce Bn, Wg Cdr FO Dobron, Mr. David Mapaderun (Registrar) and Sqn Ldr CU Ukaonu.",
                                    "images": ["images/nafsfa-history/20.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2016",
                            "highlights": [
                                {
                                    "description": "Picture of pioneer staff of NAFSFA Badagry. Standing from the Left: Sgt Ileasu, MWO Banny A, FS Olatunji O, Sgt Zubaru, Sgt Ongba, Sgt Oyema CO, WO Fagbohun O and WO Otegbeye A. Sitting from the Left: Sqn Ldr BS Utoruwei, Gp Capt HA Adebowale (Comdt), Mr David Mapaderun and Flt Lt AO Asu.",
                                    "images": ["images/nafsfa-history/1.jpg"]
                                },
                                {
                                    "description": "Combined inauguration ceremony of Accounts Upgrading (A2 – A1) Course 3/2016 and Accounts Upgrading (A3 – A2) Course 3/2016. Standing from the left: Sgt Adefisan AF, Sgt Ugbor AA, Sgt Iliya AR, Sgt Tijani Cpl Akut P, Sgt Ajayi TO, Cpl Bawa SA, Cpl Patrick B, Cpl Abu P, Cpl Ochigbo R, Sgt Rasheed TA, Cpl Bamidele TC, Cpl Ayuba BS, Sgt Abdullahi S, Sgt Liasu A and Sgt Zubairu L. Squatting from the left: Sgt Nweke S, Cpl Ibrahim SA, Sgt Adenola SG and Sgt Odoh DA.",
                                    "images": ["images/nafsfa-history/21.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 – A1) Course 3/2016 and Accounts Upgrading (A3 – A2) Course 3/2016. Standing from the left: WO Oyema, Mr Adebowale T, Sgt Adefisan AF, Sgt Ugbor AA, Sgt Iliya AR, Sgt Tijani Cpl Akut P, Sgt Ajayi TO, Cpl Bawa SA, Cpl Patrick B, Cpl Abu P, Cpl Ochigbo R, Sgt Rasheed TA, Cpl Bamidele TC, Cpl Ayuba BS, Sgt Abdullahi S, Sgt Liasu A, Sgt Zubairu L, Sgt Nweke S, Cpl Ibrahim SA, Sgt Adenola SG, Sgt Odoh DA, Fg Offr FA Alfa, Flt Lt ID Yahaya, Fg Offr MM Kabiru, FS Oyema and MWO Aderibigbe. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), CO 243 Recce Bn, Compt Immigration Owode, CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), Wg Cdr OG Olubodun (Comdt), Compt Custom Owode, Rep of DG ASCON, Wg Cdr FO Dobron and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/22.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course (IBAC) 2/2016. Standing from the left: Mr Adebowale, Fg Offr FA Alfa, WO Olatunji Cpl Odeyemi, ACW Isah B, Cpl Sule G, MWO Ayilara, ACM Amos P, ACM Abba AE, Lcpl Nura MA, ACW Ganiyu RO, ACM Golit GS, ACM Cole IO, ACM Dubi AK, ACW Afuwape RT, ACM Efosa D, ACW Akinosho AO, Cpl Patrik B, Cpl Salami HA, Fg Offr MB Tukur, Fg Offr MM Kabiru and Flt Lt ID Yahaya. Sitting from the left: Sqn Ldr M Usman, 2iC NN FOB Badagry, Wg Cdr CS Visan, CO 243 Recce Bn, CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), Gp Capt SB Ojo (Comdt), HOD Fin Mgt studies ASCON, Wg Cdr OK Cole and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/23.jpg"]
                                }
                            ]
                        }
                    ],
                    "2017-2027": [
                        {
                            "year": "2017",
                            "highlights": [
                                {
                                    "description": "Graduands of Finance Young Officers Course 1/2017 with Academic Registrar. From the left: Fg Offr KT Zakka, Fg Offr AM Soroma, Fg Offr TB Boye, Flt Lt YA Kudu, Mr. David Mapaderun (Registrar), Fg Offr S Audu, Fg Offr S Suleiman and Flt Lt KC Eze.",
                                    "images": ["images/nafsfa-history/2.jpg"]
                                },
                                {
                                    "description": "International Public Sector Accounting Standards Workshop for Finance Young Officers Course 1/2017 at Administrative Staff College of Nigeria, Badagry. Standing from the rear left: ASCON Staff, Flt Lt KC Eze, Fg Offr AM Soroma, Fg Offr KT Zakka, Fg Offr H Ibrahim (GFO), Fg Offr S Audu. Middle: Fg Offr S Suleiman, MWO Aderibigbe, Sqn Ldr AU Ahmed, MWO Inedu, Fg Offr TB Boye, MWO Hashim, Fg Offr YA Kudu, Flt Lt Ogboma. Sitting from the left: ASCON Staff, Mr David Mapaderun (NAFSFA Registrar), Wg Cdr OG Olubodun (Comdt), ASCON Staff, Wg Cdr A Samaila (CI) and ASCON Staff.",
                                    "images": ["images/nafsfa-history/3.jpg"]
                                },
                                {
                                    "description": "Students of Finance Young Officers Course 1/2017 and guests receiving lecture on Accounting Profession delivered by Mr Kehinde Bisiriyu.",
                                    "images": ["images/nafsfa-history/4.jpg"]
                                },
                                {
                                    "description": "The Comdt Wg Cdr OG Olubodun inaugurating Accounts Upgrading (A2 – A1) Course 4/2017 and Accounts Upgrading (A3 – A2) Course 4/2017.",
                                    "images": ["images/nafsfa-history/24.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 4/2017 and Accounts Upgrading (A3 –A2) Course 4/2017. Standing from the left: Sgt Yahaya KR, WO Eyo, WO Olatunji, Sgt Anthony J, Sgt Nkume D, Sgt Anthony MA, Sgt Ugwezumba E, Sgt Emmanuel C, Sgt Umar N, CpI Alejolowo OB, Sgt Boniface AO, Cpl Pada BJ, CpI Albita M, Sgt Samaila B, Sgt Bala BD, Lcpl Mohammed H, Lcpl Nora MA, Sgt Oluwaleye FL, Lcpl Eze FC, CpI Usman YG, Sgt Bipoe HJ, CpI Yusuf Al, Sgt Obileke LF, Sgt Ufort JG, Sgt Oludoyi AO, MWO Sanni, Sgt Abgolahor IE, Sgt Anita Je and Sgt Nathaniel B. Sitting from the left: Fit Lt FA Alfa, Wg Cdr IK Ifeorah (Comd NAF MCH), Air Cdre EO Chukwu (Comd 121 FOB), Wg Cdr OG Olubodun (Comdt), Wg Cdr I Yakubu (CI), Mr David Mapaderun (Registrar) and Fg Offr MB Tukur.",
                                    "images": ["images/nafsfa-history/25.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2018",
                            "highlights": [
                                {
                                    "description": "Comdt (Gp Capt GN Udoh) delivering speech at the inauguration ceremony of Finance Young Officers Course 2/2018.",
                                    "images": ["images/nafsfa-history/5.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Finance Young Officers Course 2/2018. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Joseph, Fg Offr I Musa, Fg Offr EJ Agida, Fg Offr LF Tukur, Fg Offr AA Adelakun, Fg Offr IE Ekinya, Fg Offr E Musa, Fg Offr JI Ozoelo, Fg Offr MA Abubakar, Fg Offr AH Saidu, Fg Offr S Audu, Fg Offr MM Kabiru, Fg Offr JY Haggai and Flt Lt Okunbor. Sitting from the left: Mr David Mapaderun (Registrar), Sec Comd FRSC Owode, Comptroller Custom Owode, CO 243 Recce Battalion, DG Nig. French Village Badagry, Oba of Apa, AVM RN Ekeh (AOC LC), Gp Capt GN Udoh (Comdt), AVM JA Ochomma (Comd 081 PAG), Air Cdre MO Udonibo, Wg Cdr MA Ola, Comptroller Custom Seme, Wg Cdr I Yakubu and Wg Cdr BS Utoruwei.",
                                    "images": ["images/nafsfa-history/6.jpg"]
                                },
                                {
                                    "description": "Finance Young Officers Course 2/2018 during a workshop on Foreign Payment Procedure in the NAF. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Joseph, Fg Offr I Musa, Fg Offr EJ Agida, Fg Offr IE Ekinya, Fg Offr LF Tukur, Fg Offr JI Ozoelo, Fg Offr MA Abubakar, Fg Offr AA Adelakun, Fg Offr E Musa and Fg Offr AH Saidu. Sitting from the left: Wg Cdr I Yakubu (CI), Air Cdre HA Adebowale (Guest Lecturer), Gp Capt GN Udoh (Comdt) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/7.jpg"]
                                },
                                {
                                    "description": "Finance Young Officers Course 2/2018 during a lecture on the Role and Activities of 081 PAG. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Ozoelo, Fg Offr EJ Agida, Fg Offr AA Adelakun, Fg Offr IE Ekinya, Fg Offr I Musa, Fg Offr MA Abubakar, Fg Offr LF Tukur, Fg Offr E Musa and Fg Offr AH Saidu. Sitting from the left: Fg Offr JI Joseph, Wg Cdr I Yakubu (CI), Gp Capt GN Udoh (Comdt), Sqn Ldr GA Fatai (Guest Lecturer) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/8.jpg"]
                                },
                                {
                                    "description": "Inauguration of Accounts Upgrading (A2 – A1) Course 5/2018. Standing from the left: Sgt Badiru EO, Sgt Ogunya BO, Sgt Ochikiri S, Sgt Eteng FU, Sgt Shuaibu SR, Sgt Sekibo M, Sgt Isah A, Sgt Alfa MA, Sgt Adebiyi R, Sgt Alao BA, Sgt Sunday LO, Sgt Abdulraham A, Sgt Obang PM, Sgt Akor J, Sgt Sadiq M, Sgt Adeniji FE and Sgt Adamu B. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), Wg Cdr A Samaila, Gp Capt GN Odoh (Comdt), Wg Cdr I Yakubu (CI) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/26.jpg"]
                                },
                                {
                                    "description": "Inauguration of Accounts Upgrading (A3 – A2) Course 5/2018. Standing from the left: Cpl Balogun EJ, Cpl Tijani AS, Cpl Ugwunna, Cpl Adebayo, Cpl Idowu DO, Cpl Mohammed AS and Cpl Ile HN. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), Wg Cdr A Samaila, Gp Capt GN Odoh (Comdt), Wg Cdr I Yakubu (CI) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/27.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2019",
                            "highlights": [
                                {
                                        
                                    "description": "Inauguration ceremony of Basic Finance Officers Course 3/2019. From the left: Fg MA Daggash, Fg Offr HE John, Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr BS Utoruwei (Ag CI), Fg Offr RI Nkele, Fg Offr M Yakubu, Fg Offr LS Akuma and Fg Offr F Bello.",
                                    "images": ["images/nafsfa-history/9.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 3/2019. Standing from the left: Fg Offr LS Akuma, Fg Offr MA Daggash, Fg Offr HE John, Fg Offr RO Afolabi, Fg Offr F Bello, Fg Offr RI Nkele, Fg Offr M Yakubu and Fg Offr OJ Fakunle. Sitting from the left: Comptroller of Custom Owode, DG French Village, Wg Cdr FO Dobron, Mr David Mapaderun (Registrar), Rep CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), AVM CA Ogbeche (CAB, HQ NAF), Wg Cdr BS Utoruwei (Ag CI), Air Cdre AE Nweke (Rep AOC GTC), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GB Nkanang (Comd NAF M&CH), Air Cdre IP Irumheson (DOI) and Rep of DG ASCON.",
                                    "images": ["images/nafsfa-history/10.jpg"]
                                },
                                {
                                    "description": "AVM CA Ogbeche (CAB, HQ NAF) receiving salute from Quarter Guard during the graduation ceremony of Basic Finance Officers Course 3/2019.",
                                    "images": ["images/nafsfa-history/11.jpg"]
                                },
                                {
                                    "description": "Special Guest of Honour (CAB, HQ NAF) with students of Basic Finance Officers Course 3/2019. From the left: Fg Offr MA Daggash, Fg Offr LS Akuma, Fg Offr RO Afolabi, Fg Offr RI Nkele, AVM CA Ogbeche (CAB), Fg Offr HE John, Fg Offr F Bello, Fg Offr OJ Fakunle, and Fg Offr M Yakubu.",
                                    "images": ["images/nafsfa-history/12.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 6/2019 and Accounts Upgrading (A3 –A2) Course 6/2019. Standing from the left Sgt Okafor, Sgt Ayuba, CpI Usman, Sgt Albita M, Sgt Ogunyemi O, Sgt Gbenge, Sgt Bawa, Sgt Orban, Sgt Osinoye, Sgt Olajugba, Sgt Ajidahun O, Sgt Bamidele C, Sgt Akilu, Sgt Isah, Sgt Adetu, Sgt Alozie, Sgt Adebayo, Sgt Oyewole, Sgt Ezekiel, Sgt Adediran, Sgt Lebarri, CpI Arije, Sgt Usman YG, Sgt Ubonu, Sgt Hassan, Sgt Nweke, CpI Oloidi Sk, FS Babatunde and Sgt Oluwaleye. Sitting from the left FG Offr IE Ekinya, Comptroller of Custom, Wg Cdr BS Utoruwei, Gp Capt Nkanang, Oba of Apa, Gp Capt GN Udoh, AVM JA Ochomma (Comd 081 PAG), Air Cdre MO Udonibo (Comd 051 PMG), Gp Capt Argungun (CI), FRSC, 243 Recce Battalion and Mr Yemi Mapaderun.",
                                    "images": ["images/nafsfa-history/28.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 4/2019. Standing from the left: ACM Nnadi EO, ACW Irayo B, ACM Nweke BO, ACM Adetoro BO, ACW Ogunrinde OA, ACW Adeyeri HA, ACW Isuo E, ACW Ubani BE, Cpl Bassey AE, ACW Udogu EC, ACM Isa BI, ACW Abdulsalam NA, FS Babatunde D and Sgt Oluwaleye FL. Sitting from the left: Wg Cdr BS Utoruwei, Comptroller of Custom, CO NN FOB Badagry, Air Cdre Idonibo, Gp Capt Nkanang (Comd NAF MCH), Oba of Apa, Gp Capt GN Udoh (Comdt), AVM JA Ochomma (Comd 081 PAG), Air Cdre AE Nwenke (Rep AOC GTC), Gp Capt Argungun (CI), FRSC, 243 Recce Bn, Mr David Mapaderun (Registrar) and Fg Offr IE Ekinya.",
                                    "images": ["images/nafsfa-history/29.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2020",
                            "highlights": [
                                {
                                    "description": "Students of Basic Finance Officers Course 4/2020. From the left: Flt Lt AI Bello, Fg Offr AO Saka, Fg Offr SO Jimoh, Sqn Ldr MM Jekada, Fg Offr DN Abraham, Flt Lt AM Sabo, Fg Offr BM Dole and Fg Offr CW Owhonda.",
                                    "images": ["images/nafsfa-history/13.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 4/2020. Standing from the left: Fg Offr CW Owhonda, Fg Offr AO Saka, Flt Lt AM Sabo, Sqn Ldr MM Jekada, Fg Offr SO Jimoh, Fg Offr DN Abraham, Fg Offr BM Dole and Flt Lt AI Bello. Sitting from the left: Fg Offr RO Afolabi, Sqn Ldr AO Ademola, Mr David Mapaderun (Registrar), Wg Cdr OM Alegi, Comptroller Custom Seme Border, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila (Rep AOC GTC), Wg Cdr A Osasuyi (Comd NAFMCH), Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (Ag CI).",
                                    "images": ["images/nafsfa-history/14.jpg"]
                                },
                                {
                                    "description": "Students of Basic Finance Officers Course 4/2020 receiving lecture on Contemporary Issues in Public Financial Management delivered by Mr David Mapaderun (NAFSFA Registrar).",
                                    "images": ["images/nafsfa-history/15.jpg"]
                                },
                                {
                                    "description": "Students of Accounts Upgrading (A2 – A1) Course 7/2020. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/30.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 7/2020 and Accounts Upgrading (A3 –A2) Course 7/2020. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/31.jpg"]
                                },
                                {
                                    "description": "Students of Initial Basic Accounts Course 5/2020. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/32.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 5/2020. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/33.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2021",
                            "highlights": [
                                {
                                    "description": "Inauguration ceremony of Basic Finance Officers Course 5/2021. Standing from the left: Fg Offr, Fg Offr F Bako, Fg Offr Ogunbiye, Sqn Ldr MM Jekada, Fg Offr DN Abraham, Flt Lt AM Sabo, Fg Offr BM Dole and Fg Offr CW Owhonda.",
                                    "images": ["images/nafsfa-history/16.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 5/2021. Standing from the left: Fg Offr CW Owhonda, Fg Offr AO Saka, Flt Lt AM Sabo, Sqn Ldr MM Jekada, Fg Offr SO Jimoh, Fg Offr DN Abraham, Fg Offr BM Dole and Flt Lt AI Bello. Sitting from the left: Fg Offr RO Afolabi, Sqn Ldr AO Ademola, Mr David Mapaderun (Registrar), Wg Cdr OM Alegi, Comptroller Custom Seme Border, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila (Rep AOC GTC), Wg Cdr A Osasuyi (Comd NAFMCH), Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (Ag CI).",
                                    "images": ["images/nafsfa-history/17.jpg"]
                                },
                                {
                                    "description": "Students of Basic Finance Officers Course 5/2021 receiving lecture on Service Writing delivered by Fg Offr RO Afolabi (NAFSFA Admin Officer).",
                                    "images": ["images/nafsfa-history/18.jpg"]
                                },
                                {
                                    "description": "Combined inauguration ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/34.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/35.jpg"]
                                },
                                {
                                    "description": "Inauguration ceremony of Initial Basic Accounts Course 6/2021. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/36.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 6/2021. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/37.jpg"]
                                },
                                {
                                    "description": "Another view of the combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/38.jpg"]
                                },
                                {
                                    "description": "Another view of the combined inauguration ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/39.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 7/2021. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/40.jpg"]
                                },
                                {
                                    "description": "Inauguration ceremony of Initial Basic Accounts Course 7/2021. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/41.jpg"]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id":"finance-evolution",
            "logo":"images/finance-specialty-logo.png",
            "title":"Evolution of NAF Finance Specialty",
            "year-ranges":[
                {
                    "1962-1972": [
                        {
                            "year": "1972",
                            "highlights": [
                                {
                                    "description": "At inception, the financial administration of the NAF was vested with the Nigerian Army. With the passage of time, the NAF became self-accounting on 1 Apr 72 and was headed by a chief paymaster. With broader roles, growing manpower and expanded force structure witnessed in the early 1980s, the NAF Pay and Records was seperated thereby giving birth to 2 independent establishments designed as the Pay and Accounting Group and the Personnel Management Group respectively.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "1973-1983": []
                },
                {
                    "1984-1994": [
                        {
                            "year": "1990",
                            "highlights": [
                                {
                                    "description": "Before the 1980s, NAF personnel were paid salaries, allowances and other entitlements in cash via table payment. The process required a lot of manual actions such as physical cash handling that was slow and largely inaccurate. With the evolution of banking system and operations in Nigeria, the NAF Finance Corps at the time pushed for the abolishment of the table payment method and began to make payments to individual salary accounts of personnel through banks. This change brought about ease for NAF personnel and also improved efficiency and accountability.",
                                    "images":[]
                                },
                                {
                                    "description": "Prior to computerization, binders were used for computation of salaries and allowances in PAG. This required manual entries, manual computations and manual deductions of charges. A system called ACROL was used to generate and print salary schedules. Each page of the schedule had particulars of only 25 NAF personnel which were printed from the Machine Room in PAG. The NAF leveraged the computer revolution and computerized the salary payment processes in phases. As directed by HQ NAF, PAG subscribed to a programme named dBase III which was first used to process salaries of officers only. Subsequently, more efficient systems were developed leading to the NAF subscribing to a more efficient and flexible software solution called \"Soja Pay\". The system features include payroll processing, reports, summaries and data management. The system also provided a training opportunity for personnel on specialized systems training.",
                                    "images":[]
                                },
                                {
                                    "description": "Before the 1980s, NAF personnel were paid salaries, allowances and other entitlements in cash via table payment. The process required a lot of manual actions such as physical cash handling that was slow and largely inaccurate. With the evolution of banking system and operations in Nigeria, the NAF Finance Corps at the time pushed for the abolishment of the table payment method and began to make payments to individual salary accounts of personnel through banks. This change brought about ease for NAF personnel and also improved efficiency and accountability.",
                                    "images":[]
                                },
                                {
                                    "description": "Prior to computerization, binders were used for computation of salaries and allowances in PAG. This required manual entries, manual computations and manual deductions of charges. A system called ACROL was used to generate and print salary schedules. Each page of the schedule had particulars of only 25 NAF personnel which were printed from the Machine Room in PAG. The NAF leveraged the computer revolution and computerized the salary payment processes in phases. As directed by HQ NAF, PAG subscribed to a programme named dBase III which was first used to process salaries of officers only. Subsequently, more efficient systems were developed leading to the NAF subscribing to a more efficient and flexible software solution called \"Soja Pay\". The system features include payroll processing, reports, summaries and data management. The system also provided a training opportunity for personnel on specialized systems training.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                },
                {
                    "1995-2005": [
                        {
                            "year": "2003",
                            "highlights": [
                                {
                                    "description": "In an efforts towards repositioning and rebranding, a new logo was created for the NAF Finance Corps. The new logo depicted cowry shells symbolizing the medium of exchange widely used in African and some Asian countries.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "2006-2016": [
                        {
                            "year": "2008",
                            "highlights": [
                                {
                                    "description": "Pay officers serving in pay offices in NAF units and command HQs are shouldered with the responsibility of periodic rendition of returns for all public funds expended. The rendition of returns required printing of government special accounting forms such as AB57, G.1033 and P.1922 among others. Prior to 2008, special provisions were not made to print the forms, thereby hindering the ability of the pay officers and supervisors to carryout their statutory duties. The CAB, Air Cdre SA Yushau approved the allocation of funds to all pay offices for provision of accounting forms, manuals and servicing of critical machines as well as appliances.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2009",
                            "highlights": [
                                {
                                    "description": "In 2009, Air Cdre AA Malomo sought the approval of the CAS, Air Mshl OO Petinrin to introduce a monthly staff grant for AVMs in the NAF. The laudable initiative was to provide AVMs with resources to encourage and empower them to effectively carry out the taskings of the respective strategic roles they played towards actualization of NAF objectives. The impact the grant had on welfare of NAF senior officers led the Army and Navy to adopt the same initiative. Subsequently, the grant was standardized, approved and gazetted in the MAFA among other non-regular allowances paid to personnel of the 3 services.",
                                    "images":[]
                                },
                                {
                                    "description": "Payslips were earlier printed in hardcopy slips and distributed to various units and commands. The monthly distributions required significant logistics. Also, a good number of personnel either get their payslips late or do not get them. With the passing of time, the NAF Finance Corps leveraged available solutions to electronically generate payslips and send to respective personnel either via emails or to mobile telephones numbers using bulk messaging services.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                },
                {
                    "2017-2027": [
                        {
                            "year": "2018",
                            "highlights": [
                                {
                                    "description": "In line with the Federal Government Financial Reforms, the erstwhile Office of the NAF Cashier was re-designated to CO Treasury Wing. The change was in compliance with Federal Government financial policy.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to enhance accountability and streamline Federal Government salary payment processes, the NAF integrated the payroll of its personnel into the IPPIS platform. Though it came with a lot of administrative challenges, the A&B Branch ensured constant liaison to ensure strict compliance and operationalization.",
                                    "images":[]
                                },
                                {
                                    "description": "In compliance with the Federal Government directive, the A&B Branch adopted the GIFMIS which is a web-based platform designed to streamline and automate government financial transactions in Nigeria. The platform allowed access to finance personnel in the A&B Branch to upload and track payments to the NAF in real-time. The system supported the FGN Treasury Single Account policy. This has overtime proven to enhance efficiency of financial operations.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2021",
                            "highlights": [
                                {
                                    "description": "As a coastal town and its low-lying terrain, Badagry experienced annual flooding as a result of constant rainfall. This led to waterlogging of NAFSFA academic area and students' hostel. The situation gave rise to concerns of health, flooding and transportation challenges. This forced the School to constantly alter its academic calendar which occasionally had an effect on the promotion of finance clerks. In view of the environmental challenges, Ibadan was designed as the permanent site of NAFSFA.",
                                    "images":[]
                                },
                                {
                                    "description": "In 2021, the idea to establish a microfinance bank for the NAF was conceived by AVM CA Ogbeche. Later that year, a committee was constituted by AVM JA Ochomma which lead to registrations with CBN and development of a feasibility study for the microfinance bank. AVM HA Adebowale was tasked with the responsibility of sorting out all documentation in accordance with CBN regulations. Also, AVM HA Adebowale led the advocacy to NAFILGC and her subsidiaries to be major shareholders of the microfinance bank. After the fulfillment of all the requirements, NAF Microfinance Bank was established. After obtaining the approval of the CAS, Air Mshl HB Abubakar, the CAB, AVM CU Nwagwu pushed for the commissioning of the bank in NAF Valley, Asokoro, Abuja. The NAF Microfinance Bank was established to primarily avail NAF personnel and their dependents an alternative of specially tailored banking services. Similarly, an objective of the NAF Microfinance Bank was to offer personnel opportunity to enjoy products specially developed to cater to their welfare needs.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2023",
                            "highlights": [
                                {
                                    "description": "In order to facilitate communication and foster a sense of unity and shared purpose among finance personnel, the CAB introduced the conduct of quarterly virtual meetings with all finance officers. The virtual meetings offered a platform for finance officers to listen and participate in discussions. Also, officers were offered the opportunity to brief the Branch on happenings in their respective units.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to meet the specific needs and ensure optimum utilization of space and enhanced efficiency, a building design was conceptualized and developed for NAFSFA in Ibadan. The building design was carefully developed to capture all the special needs of a standard academic institution.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2024",
                            "highlights": [
                                {
                                    "description": "In an effort to continually develop the capacity of finance officers and clerks, the CAB directed the conduct of an in-house training in the A&B Branch. The purpose was to avail finance personnel an opportunity to have a deeper understanding of the budgeting and payment processes initiated by HQ NAF. Also, the training was aimed at providing an opportunity for the personnel to have a first hand feel of the working nature in the A&B Branch.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to train and develop the capacity of NAF finance personnel, the CAB leveraged a key driver of the CAS to introduce intermediate and advanced finance courses in NAFSFA. The objective was to close the knowledge gap and continually train finance personnel on the constant evolution of the global finance as a profession.",
                                    "images":[]
                                },
                                {
                                    "description": "A team of experienced finance officers were tasked to develop curricula for an intermediate and an advanced finance course for finance clerks and officers. The curricula covered various academic areas that are generally aimed at equipping finance personnel to execute their roles in a constantly evolving profession.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2025",
                            "highlights": [
                                {
                                    "description": "The completion of the permanent NAFSFA facility in Ibadan marked the successful relocation of the school from its temporary site in Badagry to its purpose-built permanent home.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
