{
    "sections": [
        {
            "id": "naf-history",
            "logo": "images/naf-logo.png",
            "title": "NAF History",
            "year-ranges": []
        },
        {
            "id":"nafsfa-history",
            "logo":"images/nafsfa-logo.png",
            "title":"NAF School of Finance and Accounts",
            "year-ranges":[
                {
                    "2006-2016": [
                        {
                            "year": "2015",
                            "highlights": [
                                {
                                    "description": "Graduation ceremony of Accounts Upgrading (A2 – A1) Course 1/2015 with pioneer staff and students. Standing from the left: MWO Banny A (Instr), WO Fagbohun O (Instr), Sgt Fatai AA, Sgt Oruekhigbemen P, Sgt Onuh S, Sgt Imbazi ML, Sgt Zinchak DS, Sgt Ogbu OD, Sgt Jauro BB, Sgt Aworo DR, Sgt Peter I, WO Otegbeye A (Instr), Cpl Oyema CO, FS Olatunji O and WO Sanni MO (Instr). Sitting from the left: Fg Offr PS Onah, Sqn Ldr BS Utoruwei (CI), Gp Capt HA Adebowale (Comdt), Gp Capt RT Ojo and Flt Lt AO Asu.",
                                    "images": ["images/nafsfa-history/19.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Accounts Upgrading (A3 – A2) Course 2/2015. Standing from the left: Flt Lt AO Asu, WO Sanni MO, WO Fagbohun O, Cpl Oluwole OC, Cpl Ogunyemi O, Cpl Aburumakun, Cpl Ibeze MI, Lcpl Oloidi SK, Cpl Alozie CO, Cpl Akor FA, Cpl Isaka L, Cpl Lebari LT, Cpl Oyema, FS Olatunji O and WO Otegbeye A. Sitting from the left: Sqn Ldr BS Utoruwei (CI), Gp Capt RT Ojo, Rep of Oba Apa, Gp Capt GN Udoh, CO 243 Recce Bn, Gp Capt HA Adebowale (Comdt), Air Cdre JA Ochomma (Comd 081PAG), Air Cdre C Umolu, Rep DG Ascon, 2iC CO 243 Recce Bn, Wg Cdr FO Dobron, Mr. David Mapaderun (Registrar) and Sqn Ldr CU Ukaonu.",
                                    "images": ["images/nafsfa-history/20.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2016",
                            "highlights": [
                                {
                                    "description": "Picture of pioneer staff of NAFSFA Badagry. Standing from the Left: Sgt Ileasu, MWO Banny A, FS Olatunji O, Sgt Zubaru, Sgt Ongba, Sgt Oyema CO, WO Fagbohun O and WO Otegbeye A. Sitting from the Left: Sqn Ldr BS Utoruwei, Gp Capt HA Adebowale (Comdt), Mr David Mapaderun and Flt Lt AO Asu.",
                                    "images": ["images/nafsfa-history/1.jpg"]
                                },
                                {
                                    "description": "Combined inauguration ceremony of Accounts Upgrading (A2 – A1) Course 3/2016 and Accounts Upgrading (A3 – A2) Course 3/2016. Standing from the left: Sgt Adefisan AF, Sgt Ugbor AA, Sgt Iliya AR, Sgt Tijani Cpl Akut P, Sgt Ajayi TO, Cpl Bawa SA, Cpl Patrick B, Cpl Abu P, Cpl Ochigbo R, Sgt Rasheed TA, Cpl Bamidele TC, Cpl Ayuba BS, Sgt Abdullahi S, Sgt Liasu A and Sgt Zubairu L. Squatting from the left: Sgt Nweke S, Cpl Ibrahim SA, Sgt Adenola SG and Sgt Odoh DA.",
                                    "images": ["images/nafsfa-history/21.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 – A1) Course 3/2016 and Accounts Upgrading (A3 – A2) Course 3/2016. Standing from the left: WO Oyema, Mr Adebowale T, Sgt Adefisan AF, Sgt Ugbor AA, Sgt Iliya AR, Sgt Tijani Cpl Akut P, Sgt Ajayi TO, Cpl Bawa SA, Cpl Patrick B, Cpl Abu P, Cpl Ochigbo R, Sgt Rasheed TA, Cpl Bamidele TC, Cpl Ayuba BS, Sgt Abdullahi S, Sgt Liasu A, Sgt Zubairu L, Sgt Nweke S, Cpl Ibrahim SA, Sgt Adenola SG, Sgt Odoh DA, Fg Offr FA Alfa, Flt Lt ID Yahaya, Fg Offr MM Kabiru, FS Oyema and MWO Aderibigbe. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), CO 243 Recce Bn, Compt Immigration Owode, CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), Wg Cdr OG Olubodun (Comdt), Compt Custom Owode, Rep of DG ASCON, Wg Cdr FO Dobron and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/22.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course (IBAC) 2/2016. Standing from the left: Mr Adebowale, Fg Offr FA Alfa, WO Olatunji Cpl Odeyemi, ACW Isah B, Cpl Sule G, MWO Ayilara, ACM Amos P, ACM Abba AE, Lcpl Nura MA, ACW Ganiyu RO, ACM Golit GS, ACM Cole IO, ACM Dubi AK, ACW Afuwape RT, ACM Efosa D, ACW Akinosho AO, Cpl Patrik B, Cpl Salami HA, Fg Offr MB Tukur, Fg Offr MM Kabiru and Flt Lt ID Yahaya. Sitting from the left: Sqn Ldr M Usman, 2iC NN FOB Badagry, Wg Cdr CS Visan, CO 243 Recce Bn, CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), Gp Capt SB Ojo (Comdt), HOD Fin Mgt studies ASCON, Wg Cdr OK Cole and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/23.jpg"]
                                }
                            ]
                        }
                    ],
                    "2017-2027": [
                        {
                            "year": "2017",
                            "highlights": [
                                {
                                    "description": "Graduands of Finance Young Officers Course 1/2017 with Academic Registrar. From the left: Fg Offr KT Zakka, Fg Offr AM Soroma, Fg Offr TB Boye, Flt Lt YA Kudu, Mr. David Mapaderun (Registrar), Fg Offr S Audu, Fg Offr S Suleiman and Flt Lt KC Eze.",
                                    "images": ["images/nafsfa-history/2.jpg"]
                                },
                                {
                                    "description": "International Public Sector Accounting Standards Workshop for Finance Young Officers Course 1/2017 at Administrative Staff College of Nigeria, Badagry. Standing from the rear left: ASCON Staff, Flt Lt KC Eze, Fg Offr AM Soroma, Fg Offr KT Zakka, Fg Offr H Ibrahim (GFO), Fg Offr S Audu. Middle: Fg Offr S Suleiman, MWO Aderibigbe, Sqn Ldr AU Ahmed, MWO Inedu, Fg Offr TB Boye, MWO Hashim, Fg Offr YA Kudu, Flt Lt Ogboma. Sitting from the left: ASCON Staff, Mr David Mapaderun (NAFSFA Registrar), Wg Cdr OG Olubodun (Comdt), ASCON Staff, Wg Cdr A Samaila (CI) and ASCON Staff.",
                                    "images": ["images/nafsfa-history/3.jpg"]
                                },
                                {
                                    "description": "Students of Finance Young Officers Course 1/2017 and guests receiving lecture on Accounting Profession delivered by Mr Kehinde Bisiriyu.",
                                    "images": ["images/nafsfa-history/4.jpg"]
                                },
                                {
                                    "description": "The Comdt Wg Cdr OG Olubodun inaugurating Accounts Upgrading (A2 – A1) Course 4/2017 and Accounts Upgrading (A3 – A2) Course 4/2017.",
                                    "images": ["images/nafsfa-history/24.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 4/2017 and Accounts Upgrading (A3 –A2) Course 4/2017. Standing from the left: Sgt Yahaya KR, WO Eyo, WO Olatunji, Sgt Anthony J, Sgt Nkume D, Sgt Anthony MA, Sgt Ugwezumba E, Sgt Emmanuel C, Sgt Umar N, CpI Alejolowo OB, Sgt Boniface AO, Cpl Pada BJ, CpI Albita M, Sgt Samaila B, Sgt Bala BD, Lcpl Mohammed H, Lcpl Nora MA, Sgt Oluwaleye FL, Lcpl Eze FC, CpI Usman YG, Sgt Bipoe HJ, CpI Yusuf Al, Sgt Obileke LF, Sgt Ufort JG, Sgt Oludoyi AO, MWO Sanni, Sgt Abgolahor IE, Sgt Anita Je and Sgt Nathaniel B. Sitting from the left: Fit Lt FA Alfa, Wg Cdr IK Ifeorah (Comd NAF MCH), Air Cdre EO Chukwu (Comd 121 FOB), Wg Cdr OG Olubodun (Comdt), Wg Cdr I Yakubu (CI), Mr David Mapaderun (Registrar) and Fg Offr MB Tukur.",
                                    "images": ["images/nafsfa-history/25.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2018",
                            "highlights": [
                                {
                                    "description": "Comdt (Gp Capt GN Udoh) delivering speech at the inauguration ceremony of Finance Young Officers Course 2/2018.",
                                    "images": ["images/nafsfa-history/5.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Finance Young Officers Course 2/2018. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Joseph, Fg Offr I Musa, Fg Offr EJ Agida, Fg Offr LF Tukur, Fg Offr AA Adelakun, Fg Offr IE Ekinya, Fg Offr E Musa, Fg Offr JI Ozoelo, Fg Offr MA Abubakar, Fg Offr AH Saidu, Fg Offr S Audu, Fg Offr MM Kabiru, Fg Offr JY Haggai and Flt Lt Okunbor. Sitting from the left: Mr David Mapaderun (Registrar), Sec Comd FRSC Owode, Comptroller Custom Owode, CO 243 Recce Battalion, DG Nig. French Village Badagry, Oba of Apa, AVM RN Ekeh (AOC LC), Gp Capt GN Udoh (Comdt), AVM JA Ochomma (Comd 081 PAG), Air Cdre MO Udonibo, Wg Cdr MA Ola, Comptroller Custom Seme, Wg Cdr I Yakubu and Wg Cdr BS Utoruwei.",
                                    "images": ["images/nafsfa-history/6.jpg"]
                                },
                                {
                                    "description": "Finance Young Officers Course 2/2018 during a workshop on Foreign Payment Procedure in the NAF. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Joseph, Fg Offr I Musa, Fg Offr EJ Agida, Fg Offr IE Ekinya, Fg Offr LF Tukur, Fg Offr JI Ozoelo, Fg Offr MA Abubakar, Fg Offr AA Adelakun, Fg Offr E Musa and Fg Offr AH Saidu. Sitting from the left: Wg Cdr I Yakubu (CI), Air Cdre HA Adebowale (Guest Lecturer), Gp Capt GN Udoh (Comdt) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/7.jpg"]
                                },
                                {
                                    "description": "Finance Young Officers Course 2/2018 during a lecture on the Role and Activities of 081 PAG. Standing from the left: Fg Offr EJ Okenu, Fg Offr JI Ozoelo, Fg Offr EJ Agida, Fg Offr AA Adelakun, Fg Offr IE Ekinya, Fg Offr I Musa, Fg Offr MA Abubakar, Fg Offr LF Tukur, Fg Offr E Musa and Fg Offr AH Saidu. Sitting from the left: Fg Offr JI Joseph, Wg Cdr I Yakubu (CI), Gp Capt GN Udoh (Comdt), Sqn Ldr GA Fatai (Guest Lecturer) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/8.jpg"]
                                },
                                {
                                    "description": "Inauguration of Accounts Upgrading (A2 – A1) Course 5/2018. Standing from the left: Sgt Badiru EO, Sgt Ogunya BO, Sgt Ochikiri S, Sgt Eteng FU, Sgt Shuaibu SR, Sgt Sekibo M, Sgt Isah A, Sgt Alfa MA, Sgt Adebiyi R, Sgt Alao BA, Sgt Sunday LO, Sgt Abdulraham A, Sgt Obang PM, Sgt Akor J, Sgt Sadiq M, Sgt Adeniji FE and Sgt Adamu B. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), Wg Cdr A Samaila, Gp Capt GN Odoh (Comdt), Wg Cdr I Yakubu (CI) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/26.jpg"]
                                },
                                {
                                    "description": "Inauguration of Accounts Upgrading (A3 – A2) Course 5/2018. Standing from the left: Cpl Balogun EJ, Cpl Tijani AS, Cpl Ugwunna, Cpl Adebayo, Cpl Idowu DO, Cpl Mohammed AS and Cpl Ile HN. Sitting from the left: Wg Cdr IK Ifeorah (Comd NAF MCH), Wg Cdr A Samaila, Gp Capt GN Odoh (Comdt), Wg Cdr I Yakubu (CI) and Mr David Mapaderun (Registrar).",
                                    "images": ["images/nafsfa-history/27.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2019",
                            "highlights": [
                                {
                                        
                                    "description": "Inauguration ceremony of Basic Finance Officers Course 3/2019. From the left: Fg MA Daggash, Fg Offr HE John, Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr BS Utoruwei (Ag CI), Fg Offr RI Nkele, Fg Offr M Yakubu, Fg Offr LS Akuma and Fg Offr F Bello.",
                                    "images": ["images/nafsfa-history/9.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 3/2019. Standing from the left: Fg Offr LS Akuma, Fg Offr MA Daggash, Fg Offr HE John, Fg Offr RO Afolabi, Fg Offr F Bello, Fg Offr RI Nkele, Fg Offr M Yakubu and Fg Offr OJ Fakunle. Sitting from the left: Comptroller of Custom Owode, DG French Village, Wg Cdr FO Dobron, Mr David Mapaderun (Registrar), Rep CO NN FOB Badagry, AVM JA Ochomma (Comd 081 PAG), AVM CA Ogbeche (CAB, HQ NAF), Wg Cdr BS Utoruwei (Ag CI), Air Cdre AE Nweke (Rep AOC GTC), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GB Nkanang (Comd NAF M&CH), Air Cdre IP Irumheson (DOI) and Rep of DG ASCON.",
                                    "images": ["images/nafsfa-history/10.jpg"]
                                },
                                {
                                    "description": "AVM CA Ogbeche (CAB, HQ NAF) receiving salute from Quarter Guard during the graduation ceremony of Basic Finance Officers Course 3/2019.",
                                    "images": ["images/nafsfa-history/11.jpg"]
                                },
                                {
                                    "description": "Special Guest of Honour (CAB, HQ NAF) with students of Basic Finance Officers Course 3/2019. From the left: Fg Offr MA Daggash, Fg Offr LS Akuma, Fg Offr RO Afolabi, Fg Offr RI Nkele, AVM CA Ogbeche (CAB), Fg Offr HE John, Fg Offr F Bello, Fg Offr OJ Fakunle, and Fg Offr M Yakubu.",
                                    "images": ["images/nafsfa-history/12.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 6/2019 and Accounts Upgrading (A3 –A2) Course 6/2019. Standing from the left Sgt Okafor, Sgt Ayuba, CpI Usman, Sgt Albita M, Sgt Ogunyemi O, Sgt Gbenge, Sgt Bawa, Sgt Orban, Sgt Osinoye, Sgt Olajugba, Sgt Ajidahun O, Sgt Bamidele C, Sgt Akilu, Sgt Isah, Sgt Adetu, Sgt Alozie, Sgt Adebayo, Sgt Oyewole, Sgt Ezekiel, Sgt Adediran, Sgt Lebarri, CpI Arije, Sgt Usman YG, Sgt Ubonu, Sgt Hassan, Sgt Nweke, CpI Oloidi Sk, FS Babatunde and Sgt Oluwaleye. Sitting from the left FG Offr IE Ekinya, Comptroller of Custom, Wg Cdr BS Utoruwei, Gp Capt Nkanang, Oba of Apa, Gp Capt GN Udoh, AVM JA Ochomma (Comd 081 PAG), Air Cdre MO Udonibo (Comd 051 PMG), Gp Capt Argungun (CI), FRSC, 243 Recce Battalion and Mr Yemi Mapaderun.",
                                    "images": ["images/nafsfa-history/28.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 4/2019. Standing from the left: ACM Nnadi EO, ACW Irayo B, ACM Nweke BO, ACM Adetoro BO, ACW Ogunrinde OA, ACW Adeyeri HA, ACW Isuo E, ACW Ubani BE, Cpl Bassey AE, ACW Udogu EC, ACM Isa BI, ACW Abdulsalam NA, FS Babatunde D and Sgt Oluwaleye FL. Sitting from the left: Wg Cdr BS Utoruwei, Comptroller of Custom, CO NN FOB Badagry, Air Cdre Idonibo, Gp Capt Nkanang (Comd NAF MCH), Oba of Apa, Gp Capt GN Udoh (Comdt), AVM JA Ochomma (Comd 081 PAG), Air Cdre AE Nwenke (Rep AOC GTC), Gp Capt Argungun (CI), FRSC, 243 Recce Bn, Mr David Mapaderun (Registrar) and Fg Offr IE Ekinya.",
                                    "images": ["images/nafsfa-history/29.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2020",
                            "highlights": [
                                {
                                    "description": "Students of Basic Finance Officers Course 4/2020. From the left: Flt Lt AI Bello, Fg Offr AO Saka, Fg Offr SO Jimoh, Sqn Ldr MM Jekada, Fg Offr DN Abraham, Flt Lt AM Sabo, Fg Offr BM Dole and Fg Offr CW Owhonda.",
                                    "images": ["images/nafsfa-history/13.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 4/2020. Standing from the left: Fg Offr CW Owhonda, Fg Offr AO Saka, Flt Lt AM Sabo, Sqn Ldr MM Jekada, Fg Offr SO Jimoh, Fg Offr DN Abraham, Fg Offr BM Dole and Flt Lt AI Bello. Sitting from the left: Fg Offr RO Afolabi, Sqn Ldr AO Ademola, Mr David Mapaderun (Registrar), Wg Cdr OM Alegi, Comptroller Custom Seme Border, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila (Rep AOC GTC), Wg Cdr A Osasuyi (Comd NAFMCH), Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (Ag CI).",
                                    "images": ["images/nafsfa-history/14.jpg"]
                                },
                                {
                                    "description": "Students of Basic Finance Officers Course 4/2020 receiving lecture on Contemporary Issues in Public Financial Management delivered by Mr David Mapaderun (NAFSFA Registrar).",
                                    "images": ["images/nafsfa-history/15.jpg"]
                                },
                                {
                                    "description": "Students of Accounts Upgrading (A2 – A1) Course 7/2020. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/30.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 7/2020 and Accounts Upgrading (A3 –A2) Course 7/2020. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/31.jpg"]
                                },
                                {
                                    "description": "Students of Initial Basic Accounts Course 5/2020. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/32.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 5/2020. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/33.jpg"]
                                }
                            ]
                        },
                        {
                            "year": "2021",
                            "highlights": [
                                {
                                    "description": "Inauguration ceremony of Basic Finance Officers Course 5/2021. Standing from the left: Fg Offr, Fg Offr F Bako, Fg Offr Ogunbiye, Sqn Ldr MM Jekada, Fg Offr DN Abraham, Flt Lt AM Sabo, Fg Offr BM Dole and Fg Offr CW Owhonda.",
                                    "images": ["images/nafsfa-history/16.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Basic Finance Officers Course 5/2021. Standing from the left: Fg Offr CW Owhonda, Fg Offr AO Saka, Flt Lt AM Sabo, Sqn Ldr MM Jekada, Fg Offr SO Jimoh, Fg Offr DN Abraham, Fg Offr BM Dole and Flt Lt AI Bello. Sitting from the left: Fg Offr RO Afolabi, Sqn Ldr AO Ademola, Mr David Mapaderun (Registrar), Wg Cdr OM Alegi, Comptroller Custom Seme Border, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila (Rep AOC GTC), Wg Cdr A Osasuyi (Comd NAFMCH), Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (Ag CI).",
                                    "images": ["images/nafsfa-history/17.jpg"]
                                },
                                {
                                    "description": "Students of Basic Finance Officers Course 5/2021 receiving lecture on Service Writing delivered by Fg Offr RO Afolabi (NAFSFA Admin Officer).",
                                    "images": ["images/nafsfa-history/18.jpg"]
                                },
                                {
                                    "description": "Combined inauguration ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/34.jpg"]
                                },
                                {
                                    "description": "Combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/35.jpg"]
                                },
                                {
                                    "description": "Inauguration ceremony of Initial Basic Accounts Course 6/2021. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/36.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 6/2021. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/37.jpg"]
                                },
                                {
                                    "description": "Another view of the combined graduation ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Awe JA, Lcpl Golit GS, Cpl Balogun EJ, Cpl Lawal BG, Cpl Pada BJ, Cpl Sule G, Cpl Salami HA, Cpl Haruna A, Sgt Adebayo O, Cpl Yusuf AI, Cpl Sikirullahi AT and Sgt Masade JI. Middle from the left: Cpl Adigwe AM, Cpl Abu P, ACM Ode RO, Sgt Akinwale IR, Cpl Ile HN, ACW Ogunderu EI, Sgt Bashir A, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Jimoh FA, Cpl Gatta AM, Cpl Gimba IA and Cpl Hassan A. Sitting from the left: Fg Offr OJ Fakunle, Fg Offr RO Afolabi, Wg Cdr IA Ojibara, Wg Cdr FO Dobron, Wg Cdr RK Olundu (Ag Comdt), Air Cdre MA Akiode (Comd 121 FOB), Air Cdre GN Udoh (DOAccts), Wg Cdr A Osasuyi (Comd NAFMCH), Wg Cdr BS Utoruwei, Mr David Mapaderun (Registrar) and Sqn Ldr AO Ademola.",
                                    "images": ["images/nafsfa-history/38.jpg"]
                                },
                                {
                                    "description": "Another view of the combined inauguration ceremony of Accounts Upgrading (A2 –A1) Course 8/2021 and Accounts Upgrading (A3 –A2) Course 8/2021. Standing from the rear left: Cpl Salami HA, Cpl Lawal BG, Cpl Sule G, Cpl Haruna A, Cpl Sikirullahi AT, Cpl Adigwe AM, Cpl Gimba IA, Cpl Awe JA, Cpl Hassan A, Sgt Masade JI and Cpl Balogun EJ. Standing from the front left: Sgt Adebayo O, Sgt Bashir A, Cpl Pada BJ, Sgt Iroka JO, Cpl Ibrahim SA, Cpl Gatta AM, Cpl Abu P, Sgt Akinwale IR, Cpl Ile HN Cpl Jimoh FA and Cpl Yusuf AI.",
                                    "images": ["images/nafsfa-history/39.jpg"]
                                },
                                {
                                    "description": "Graduation ceremony of Initial Basic Accounts Course 7/2021. Standing from the rear left: ACM Menyene J, ACM Alugmi BP, ACW Danjuma C, ACM Muhammad A, ACM Audu H, ACM Yaro ST, ACM Ezeani KT, ACW Lawrence O, ACM Aderibigbe RA and ACM Otti EA. Standing from the front left: ACM Lawal K, ACM Umar SB, ACW Seidu HO, ACW James ME, ACW Pogo PA, ACW Habib WB, ACW Jared RJ, ACM Awodi S, ACM Saka YT and ACM Adamu S.",
                                    "images": ["images/nafsfa-history/40.jpg"]
                                },
                                {
                                    "description": "Inauguration ceremony of Initial Basic Accounts Course 7/2021. Standing from the rear left: ACM Menyene J, ACW Habib WB, ACM Audu H, ACM Aderibigbe RA, ACW Lawrence O, ACM Yaro ST, ACM Saka YT, ACM Danjuma C, ACM Ezeani KT and ACM Otti EA. Middle from the left: ACM Alugmi BP, ACM Lawal K, ACM Adamu S, ACW Seidu HO, ACW Jared RJ, ACM Muhammad A, ACW Pogo PA, ACM Umar SB, ACW James ME and ACM Awodi S. Sitting from the left: Fg Offr RO Afolabi, Mr David Mapaderun, Wg Cdr OM Alegi, Comptroller Custom Seme Boarder, Wg Cdr FO Dobron, Air Cdre MO Udonibo (Comd 051 PMG), AVM JA Ochomma (Comd 081 PAG), Wg Cdr RK Olundu (Comdt), CO NN FOB Badagry, Wg Cdr A Samaila, Wg Cdr A Osasuyi, Sec Comd FRSC Owode, DG ASCON, Wg Cdr IA Ojibara and Wg Cdr BS Utoruwei (HOD).",
                                    "images": ["images/nafsfa-history/41.jpg"]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id":"finance-evolution",
            "logo":"images/finance-specialty-logo.png",
            "title":"Evolution of NAF Finance Specialty",
            "year-ranges":[
                {
                    "1962-1972": [
                        {
                            "year": "1972",
                            "highlights": [
                                {
                                    "description": "At inception, the financial administration of the NAF was vested with the Nigerian Army. With the passage of time, the NAF became self-accounting on 1 Apr 72 and was headed by a chief paymaster. With broader roles, growing manpower and expanded force structure witnessed in the early 1980s, the NAF Pay and Records was seperated thereby giving birth to 2 independent establishments designed as the Pay and Accounting Group and the Personnel Management Group respectively.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "1973-1983": []
                },
                {
                    "1984-1994": [
                        {
                            "year": "1990",
                            "highlights": [
                                {
                                    "description": "Before the 1980s, NAF personnel were paid salaries, allowances and other entitlements in cash via table payment. The process required a lot of manual actions such as physical cash handling that was slow and largely inaccurate. With the evolution of banking system and operations in Nigeria, the NAF Finance Corps at the time pushed for the abolishment of the table payment method and began to make payments to individual salary accounts of personnel through banks. This change brought about ease for NAF personnel and also improved efficiency and accountability.",
                                    "images":[]
                                },
                                {
                                    "description": "Prior to computerization, binders were used for computation of salaries and allowances in PAG. This required manual entries, manual computations and manual deductions of charges. A system called ACROL was used to generate and print salary schedules. Each page of the schedule had particulars of only 25 NAF personnel which were printed from the Machine Room in PAG. The NAF leveraged the computer revolution and computerized the salary payment processes in phases. As directed by HQ NAF, PAG subscribed to a programme named dBase III which was first used to process salaries of officers only. Subsequently, more efficient systems were developed leading to the NAF subscribing to a more efficient and flexible software solution called \"Soja Pay\". The system features include payroll processing, reports, summaries and data management. The system also provided a training opportunity for personnel on specialized systems training.",
                                    "images":[]
                                },
                                {
                                    "description": "Before the 1980s, NAF personnel were paid salaries, allowances and other entitlements in cash via table payment. The process required a lot of manual actions such as physical cash handling that was slow and largely inaccurate. With the evolution of banking system and operations in Nigeria, the NAF Finance Corps at the time pushed for the abolishment of the table payment method and began to make payments to individual salary accounts of personnel through banks. This change brought about ease for NAF personnel and also improved efficiency and accountability.",
                                    "images":[]
                                },
                                {
                                    "description": "Prior to computerization, binders were used for computation of salaries and allowances in PAG. This required manual entries, manual computations and manual deductions of charges. A system called ACROL was used to generate and print salary schedules. Each page of the schedule had particulars of only 25 NAF personnel which were printed from the Machine Room in PAG. The NAF leveraged the computer revolution and computerized the salary payment processes in phases. As directed by HQ NAF, PAG subscribed to a programme named dBase III which was first used to process salaries of officers only. Subsequently, more efficient systems were developed leading to the NAF subscribing to a more efficient and flexible software solution called \"Soja Pay\". The system features include payroll processing, reports, summaries and data management. The system also provided a training opportunity for personnel on specialized systems training.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                },
                {
                    "1995-2005": [
                        {
                            "year": "2003",
                            "highlights": [
                                {
                                    "description": "In an efforts towards repositioning and rebranding, a new logo was created for the NAF Finance Corps. The new logo depicted cowry shells symbolizing the medium of exchange widely used in African and some Asian countries.",
                                    "images": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "2006-2016": [
                        {
                            "year": "2008",
                            "highlights": [
                                {
                                    "description": "Pay officers serving in pay offices in NAF units and command HQs are shouldered with the responsibility of periodic rendition of returns for all public funds expended. The rendition of returns required printing of government special accounting forms such as AB57, G.1033 and P.1922 among others. Prior to 2008, special provisions were not made to print the forms, thereby hindering the ability of the pay officers and supervisors to carryout their statutory duties. The CAB, Air Cdre SA Yushau approved the allocation of funds to all pay offices for provision of accounting forms, manuals and servicing of critical machines as well as appliances.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2009",
                            "highlights": [
                                {
                                    "description": "In 2009, Air Cdre AA Malomo sought the approval of the CAS, Air Mshl OO Petinrin to introduce a monthly staff grant for AVMs in the NAF. The laudable initiative was to provide AVMs with resources to encourage and empower them to effectively carry out the taskings of the respective strategic roles they played towards actualization of NAF objectives. The impact the grant had on welfare of NAF senior officers led the Army and Navy to adopt the same initiative. Subsequently, the grant was standardized, approved and gazetted in the MAFA among other non-regular allowances paid to personnel of the 3 services.",
                                    "images":[]
                                },
                                {
                                    "description": "Payslips were earlier printed in hardcopy slips and distributed to various units and commands. The monthly distributions required significant logistics. Also, a good number of personnel either get their payslips late or do not get them. With the passing of time, the NAF Finance Corps leveraged available solutions to electronically generate payslips and send to respective personnel either via emails or to mobile telephones numbers using bulk messaging services.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                },
                {
                    "2017-2027": [
                        {
                            "year": "2018",
                            "highlights": [
                                {
                                    "description": "In line with the Federal Government Financial Reforms, the erstwhile Office of the NAF Cashier was re-designated to CO Treasury Wing. The change was in compliance with Federal Government financial policy.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to enhance accountability and streamline Federal Government salary payment processes, the NAF integrated the payroll of its personnel into the IPPIS platform. Though it came with a lot of administrative challenges, the A&B Branch ensured constant liaison to ensure strict compliance and operationalization.",
                                    "images":[]
                                },
                                {
                                    "description": "In compliance with the Federal Government directive, the A&B Branch adopted the GIFMIS which is a web-based platform designed to streamline and automate government financial transactions in Nigeria. The platform allowed access to finance personnel in the A&B Branch to upload and track payments to the NAF in real-time. The system supported the FGN Treasury Single Account policy. This has overtime proven to enhance efficiency of financial operations.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2021",
                            "highlights": [
                                {
                                    "description": "As a coastal town and its low-lying terrain, Badagry experienced annual flooding as a result of constant rainfall. This led to waterlogging of NAFSFA academic area and students' hostel. The situation gave rise to concerns of health, flooding and transportation challenges. This forced the School to constantly alter its academic calendar which occasionally had an effect on the promotion of finance clerks. In view of the environmental challenges, Ibadan was designed as the permanent site of NAFSFA.",
                                    "images":[]
                                },
                                {
                                    "description": "In 2021, the idea to establish a microfinance bank for the NAF was conceived by AVM CA Ogbeche. Later that year, a committee was constituted by AVM JA Ochomma which lead to registrations with CBN and development of a feasibility study for the microfinance bank. AVM HA Adebowale was tasked with the responsibility of sorting out all documentation in accordance with CBN regulations. Also, AVM HA Adebowale led the advocacy to NAFILGC and her subsidiaries to be major shareholders of the microfinance bank. After the fulfillment of all the requirements, NAF Microfinance Bank was established. After obtaining the approval of the CAS, Air Mshl HB Abubakar, the CAB, AVM CU Nwagwu pushed for the commissioning of the bank in NAF Valley, Asokoro, Abuja. The NAF Microfinance Bank was established to primarily avail NAF personnel and their dependents an alternative of specially tailored banking services. Similarly, an objective of the NAF Microfinance Bank was to offer personnel opportunity to enjoy products specially developed to cater to their welfare needs.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2023",
                            "highlights": [
                                {
                                    "description": "In order to facilitate communication and foster a sense of unity and shared purpose among finance personnel, the CAB introduced the conduct of quarterly virtual meetings with all finance officers. The virtual meetings offered a platform for finance officers to listen and participate in discussions. Also, officers were offered the opportunity to brief the Branch on happenings in their respective units.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to meet the specific needs and ensure optimum utilization of space and enhanced efficiency, a building design was conceptualized and developed for NAFSFA in Ibadan. The building design was carefully developed to capture all the special needs of a standard academic institution.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2024",
                            "highlights": [
                                {
                                    "description": "In an effort to continually develop the capacity of finance officers and clerks, the CAB directed the conduct of an in-house training in the A&B Branch. The purpose was to avail finance personnel an opportunity to have a deeper understanding of the budgeting and payment processes initiated by HQ NAF. Also, the training was aimed at providing an opportunity for the personnel to have a first hand feel of the working nature in the A&B Branch.",
                                    "images":[]
                                },
                                {
                                    "description": "In order to train and develop the capacity of NAF finance personnel, the CAB leveraged a key driver of the CAS to introduce intermediate and advanced finance courses in NAFSFA. The objective was to close the knowledge gap and continually train finance personnel on the constant evolution of the global finance as a profession.",
                                    "images":[]
                                },
                                {
                                    "description": "A team of experienced finance officers were tasked to develop curricula for an intermediate and an advanced finance course for finance clerks and officers. The curricula covered various academic areas that are generally aimed at equipping finance personnel to execute their roles in a constantly evolving profession.",
                                    "images":[]
                                }
                            ]
                        },
                        {
                            "year": "2025",
                            "highlights": [
                                {
                                    "description": "The completion of the permanent NAFSFA facility in Ibadan marked the successful relocation of the school from its temporary site in Badagry to its purpose-built permanent home.",
                                    "images":[]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
